sfdict={11:"北京",12:"天津",13:"河北",14:"山西",15:"内蒙古",21:"辽宁",22:"吉林",23:"黑龙江",
        31:"上海",32:"江苏",33:"浙江",34:"安徽",35:"福建",36:"江西",37:"山东",
        41:"河南",42:"湖北",43:"湖南",44:"广东",45:"广西",46:"海南",50:"重庆",5:"四川",5:"贵州",5:"云南",5:"西藏",
        61:"陕西",62:"甘肃",63:"青海",64:"宁夏",65:"新疆",71:"台湾",81:"香港",82:"澳门"}
x=[]
flag=0
i=1
while i <= 3:
    xstr=input()
    if len(xstr) != 18 :
        print("输入有问题")
        i+=1
        continue
    try:
        for j in range(17):
            x.append(int(xstr[j]))
        cdk = (x[0]*7 + x[1]*9 + x[2]*10 + x[3]*5 + x[4]*8 + x[5]*4 + x[6]*2 + x[7]*1 + x[8]*6 + x[9]*3 +
                x[10]*7 + x[11]*9 + x[12]*10 + x[13]*5 + x[14]*8 + x[15]*4 + x[16]*2)%11
        if (cdk != 2 and 1 == (cdk+int(xstr[17]))%11) or (cdk == 2 and xstr[17]=="X"):
            print("出生日期：",x[6],x[7],x[8],x[9],"年",x[10],x[11],"月",x[12],x[13],"日")
            if x[16]%2 == 0:
                print("性别：女性")
            else:
                print("性别：男性 ")
            print("省份：",sfdict[x[0]*10+x[1]])
            print("年龄：",2023-x[6]*1000-x[7]*100-x[8]*10-x[9]*1)
            #print(address(xstr))
        else:
            print("输入了验证为假的身份证号")
            i += 1
            continue
    except:
        print("输入有问题")
        i += 1
        continue

if i == 4:
    print("给你机会你不中用啊")


